using System.Collections.Generic;

namespace BingoX.Comm.PaySDK.WeChatSDK
{
    public static class WechatErrorMessageMapping
    {
        readonly static IDictionary<int, string> dic = new Dictionary<int, string>()
        {
            {-1,"系统错误，请稍后重试" },
            {40001,"授权失败，Token无效" },
            {40003,"无效的用户编号" },
            {40007,"无效媒体编号" },
            {40013,"无效AppId" },
            {40014,"Token过期无效" },
            {40018,"菜单名称长度无效" },
            {40037,"template_id不正确" },
            {40078,"未开通卡券权限，或创建card_id与插卡时间间隔过短。" },
            {41028,"form_id不正确，或者过期" },
            {41029,"form_id已被使用" },
            {41030,"page不正确" },
            {45009,"没有剩余的调用次数" },
            {45015,"回复时间超过限制" },
            {45047,"客服接口下行条数超过上限" },
            {45072,"字段取值不对" },
            {45080,"下发输入状态，需要之前30秒内跟用户有过消息交互" },
            {45081,"已经在输入状态，不可重复下发	" },
            {48001,"功能未授权" },
            {48006,"调用超过限制次数" },

            {65400,"API不可用，即没有开通/升级到新版客服功能" },
            {65401,"无效客服帐号" },
            {65402,"客服帐号尚未绑定微信号，不能投入使用" },
            {65413,"不存在对应用户的会话信息" },
            {65414,"粉丝正在被其他客服接待" },
            {65415,"指定的客服不在线" },

            {72015,"没有开票平台的权限，请检查是否已开通相应权限。" },
            {72017,"发票抬头不一致" },
            {72023,"发票已被其他公众号锁定。一般为发票已进入后续报销流程，报销企业公众号/企业号/App锁定了发票。" },
            {72024,"发票状态错误" },
            {72025,"wx_invoice_token 无效" },
            {72028,"未设置微信支付商户信息" },
            {72030,"mchid 无效" },
            {72031,"参数错误。可能为请求中包括无效的参数名称或包含不通过后台校验的参数值" },
            {72035,"发票已经被拒绝开票。若order_id被用作参数调用过拒绝开票接口，再使用此order_id插卡机会报此错误" },
            {72036,"发票正在被修改状态，请稍后再试" },
            {72038,"订单没有授权，可能是开票平台 appid 、商户 appid 、订单 order_id 不匹配" },
            {72039,"订单未被锁定，需要先锁定再核销" },
            {72040,"Pdf 无效，请提供真实有效的 pdf" },
            {72042,"发票号码和发票代码重复，该发票已经被其它用户领取" },
            {72043,"发票号码和发票代码错误" },
            {72044,"发票抬头二维码超时" },
            {72063,"商户联系方式未空，请先调用接口设置商户联系方式" },
            {73000,"开票平台逻辑错误" },
            {73001,"OpenId错误" },
            {73002,"订单号为空" },
            {73003,"发票流水号为空" },
            {73004,"发票流水号为空" },
            {73007,"纳税人名称为空" },
            {73008,"纳税人地址为空" },
            {73009,"纳税人电话为空" },
            {73010,"购货方名称为空" },
            {73011,"开票人为空" },
            {73012,"计税合计为空" },
            {73013,"合计金额为空" },
            {73014,"合计税额为空" },
            {73015,"行业类型为空" },
            {73016,"纳税人识别号为空" },
            {73100,"开票平台错误" },
            {73101,"纳税人识别号不匹配，请求中的纳税人识别号和创建工单填写的纳税人识别号不一致" },
            {73102,"微信开票平台系统错误" },
            {73105,"开票平台开票中，请使用相同的发票请求流水号重试开票" },
            {73106,"发票请求流水号已存在，并被其他订单号占用" },
            {73107,"发票请求流水正在被处理，请通过查询接口获取结果" },
            {73108,"该订单已被其他发票请求流水处理" },
            {73110,"发票请求流水号前6位不正确" },

            {88000,"没有留言权限" },
            {88001,"该图文不存在" },
            {88003,"精选评论数已达上限" },
            {88004,"已被用户删除，无法精选" },
            {88005,"已经回复过了" },
            {88007,"回复超过长度限制或为0" },
            {88008,"该评论不存在" },
            {88010,"获取评论数目不合法" },
            {87009,"该回复不存在" },

            {101000,"图片URL错误或拉取URL图像错误" },
            {101001,"图片中无法找到证件" },
            {101002,"图片数据无效" },
        };

        public static bool InvalidToken(this WechatError error)
        {
            return error.Code == 40001;
        }
        public static string GetMessage(this WechatError error)
        {
            if (error == null) return "";
            if (dic.ContainsKey(error.Code)) return dic[error.Code];
            return string.Format("{0} {1}", error.Code, error.Message);
        }

    }



}


